select [РайонОбласти]
      ,[Наименование]
      ,[Фамилия]
      ,[Имя]
      ,[Отчество]
      ,[ДатаРождения]
      ,[улица]
      ,[НомерДома]
      ,[корпус]
      ,[НомерКвартиры]
      ,[НомерДоговора]
      ,[ДатаДоговора]
      ,[ДатаАктаВыполненныхРабот]
      ,[НомерАкта]
      ,[СуммаАктаВыполненныхРабот]
      ,[НомерРеестра]
      ,[ДатаРеестра]
      ,[СерияДокумента]
      ,[НомерДокумента]
      ,[ЛьготнаяКатегория] from dbo.ViewListRecepients
where НомерРеестра = '317' and YEAR(ДатаРеестра) = 2015
order by Наименование ASC



